# Используйте официальный образ Node в качестве базы
FROM node:21.6.0

# Установите папку приложения в контейнере
WORKDIR /usr/src/app

# Копирование package.json и package-lock.json перед выполнением npm install
COPY package*.json ./

# Установка зависимостей проекта
RUN npm install

# Добавление обновления зависимостей для устранения депрекированных модулей
RUN npm update

# Копирование файлов проекта в контейнер
COPY . .

# Открытие порта, который будет использоваться приложением
EXPOSE 3000

# Запуск приложения
CMD ["npm", "run", "dev"]